#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

aws_vpc.this[0]: Refreshing state... [id=vpc-068d9ef39571fbcdf]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-084807a6da1c8d17d]
aws_default_security_group.this[0]: Refreshing state... [id=sg-091360fc376d3addd]
aws_subnet.private[0]: Refreshing state... [id=subnet-064eeb914ebde7664]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-049b4f8c7643a4c71]
aws_subnet.public[1]: Refreshing state... [id=subnet-0cf349743a3b4f0da]
aws_route_table.private[0]: Refreshing state... [id=rtb-015c9ace323e012bd]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d12519b68c08e797]
aws_subnet.public[0]: Refreshing state... [id=subnet-00e80fb7678e7fa7f]
aws_route_table.public[0]: Refreshing state... [id=rtb-09e2ca666a95e4c85]
aws_subnet.database[0]: Refreshing state... [id=subnet-073498f208944ce63]
aws_subnet.database[1]: Refreshing state... [id=subnet-03d1623ac23332fe9]
aws_network_acl.private[0]: Refreshing state... [id=acl-0215e5f512fd2bf22]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a0b2e46c64053b54]
aws_network_acl.public[0]: Refreshing state... [id=acl-0096cb213297a5ff0]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02023f413f2572164]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09e2ca666a95e4c851080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0806c75b609fc41c6]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0174bb6ebd2e63f54]
aws_network_acl.database[0]: Refreshing state... [id=acl-0c6af6e6ef696672a]
aws_db_subnet_group.database[0]: Refreshing state... [id=test-dev-db-group]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0f72e824dbfcafd48]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0e93e88c51cb8454a]
aws_network_acl_rule.private_inbound[1]: Refreshing state... [id=nacl-1321159458]
aws_network_acl_rule.private_inbound[10]: Refreshing state... [id=nacl-804380138]
aws_network_acl_rule.private_inbound[3]: Refreshing state... [id=nacl-3413852138]
aws_network_acl_rule.private_inbound[2]: Refreshing state... [id=nacl-2156665863]
aws_network_acl_rule.private_inbound[0]: Refreshing state... [id=nacl-2468975271]
aws_network_acl_rule.private_inbound[5]: Refreshing state... [id=nacl-1077245585]
aws_network_acl_rule.private_inbound[8]: Refreshing state... [id=nacl-2400453175]
aws_network_acl_rule.private_inbound[7]: Refreshing state... [id=nacl-853438201]
aws_network_acl_rule.private_inbound[6]: Refreshing state... [id=nacl-4014520188]
aws_network_acl_rule.private_inbound[4]: Refreshing state... [id=nacl-2159345961]
aws_network_acl_rule.private_inbound[9]: Refreshing state... [id=nacl-1384307634]
aws_network_acl_rule.private_outbound[0]: Refreshing state... [id=nacl-3407258796]
aws_network_acl_rule.private_outbound[6]: Refreshing state... [id=nacl-4067878107]
aws_network_acl_rule.private_outbound[11]: Refreshing state... [id=nacl-1977283357]
aws_network_acl_rule.private_outbound[3]: Refreshing state... [id=nacl-1792381899]
aws_network_acl_rule.private_outbound[4]: Refreshing state... [id=nacl-99041437]
aws_network_acl_rule.private_outbound[5]: Refreshing state... [id=nacl-991788212]
aws_network_acl_rule.private_outbound[8]: Refreshing state... [id=nacl-3984163853]
aws_network_acl_rule.private_outbound[1]: Refreshing state... [id=nacl-1353967811]
aws_network_acl_rule.private_outbound[10]: Refreshing state... [id=nacl-21109394]
aws_network_acl_rule.private_outbound[2]: Refreshing state... [id=nacl-4050706340]
aws_network_acl_rule.private_outbound[7]: Refreshing state... [id=nacl-1994180706]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-015c9ace323e012bd1080289494]
aws_network_acl_rule.private_outbound[9]: Refreshing state... [id=nacl-2598852349]
aws_network_acl_rule.database_outbound[0]: Refreshing state... [id=nacl-1152399608]
aws_network_acl_rule.database_inbound[0]: Refreshing state... [id=nacl-3908831627]
aws_network_acl_rule.public_outbound[8]: Refreshing state... [id=nacl-2965569186]
aws_network_acl_rule.public_outbound[5]: Refreshing state... [id=nacl-3433958766]
aws_network_acl_rule.public_outbound[7]: Refreshing state... [id=nacl-1559846973]
aws_network_acl_rule.public_inbound[1]: Refreshing state... [id=nacl-676250521]
aws_network_acl_rule.public_outbound[6]: Refreshing state... [id=nacl-96834817]
aws_network_acl_rule.public_outbound[0]: Refreshing state... [id=nacl-1017501046]
aws_network_acl_rule.public_outbound[2]: Refreshing state... [id=nacl-113487486]
aws_network_acl_rule.public_outbound[4]: Refreshing state... [id=nacl-1662437414]
aws_network_acl_rule.public_outbound[9]: Refreshing state... [id=nacl-728216269]
aws_network_acl_rule.public_outbound[1]: Refreshing state... [id=nacl-2801834265]
aws_network_acl_rule.public_outbound[3]: Refreshing state... [id=nacl-2640765457]
aws_network_acl_rule.public_inbound[2]: Refreshing state... [id=nacl-3866989756]
aws_network_acl_rule.public_inbound[4]: Refreshing state... [id=nacl-3863251346]
aws_network_acl_rule.public_inbound[7]: Refreshing state... [id=nacl-3374319412]
aws_network_acl_rule.public_inbound[5]: Refreshing state... [id=nacl-650444330]
aws_network_acl_rule.public_inbound[0]: Refreshing state... [id=nacl-4124580380]
aws_network_acl_rule.public_inbound[3]: Refreshing state... [id=nacl-2544804966]
aws_network_acl_rule.public_inbound[6]: Refreshing state... [id=nacl-347528881]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09b90a3f9f2a80f9d]
aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1224344447]
aws_security_group_rule.ingress_with_cidr_blocks[2]: Refreshing state... [id=sgrule-2437240033]
aws_security_group_rule.ingress_with_cidr_blocks[3]: Refreshing state... [id=sgrule-358156365]
aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3399309446]
aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-4227598656]
aws_security_group_rule.ingress_with_cidr_blocks[4]: Refreshing state... [id=sgrule-2096142929]
aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2050955361]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance["1"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "jbCISTmpRole"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-064eeb914ebde7664"
      + tags                                 = {
          + "Name"                 = "test-dev-app-1"
          + "Role"                 = "app"
          + "git_commit"           = "052ad3ac2e9ee12416613febf92b9393b74fb6b0"
          + "git_file"             = "modules/ec2-internal/main.tf"
          + "git_last_modified_at" = "2023-05-26 08:12:26"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "ee151e8a-b42c-4f64-84dd-48852abca3ad"
        }
      + tags_all                             = {
          + "Name"                 = "test-dev-app-1"
          + "Role"                 = "app"
          + "git_commit"           = "052ad3ac2e9ee12416613febf92b9393b74fb6b0"
          + "git_file"             = "modules/ec2-internal/main.tf"
          + "git_last_modified_at" = "2023-05-26 08:12:26"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "ee151e8a-b42c-4f64-84dd-48852abca3ad"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09b90a3f9f2a80f9d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-app-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ea1c7db66fee3098"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "jb-itsyndicate_setup_only"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-00e80fb7678e7fa7f"
      + tags                                 = {
          + "Name"                 = "test-dev-bastion"
          + "Role"                 = "bastion"
          + "git_commit"           = "052ad3ac2e9ee12416613febf92b9393b74fb6b0"
          + "git_file"             = "modules/ec2-external/main.tf"
          + "git_last_modified_at" = "2023-05-26 08:12:26"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "4e333bf3-548f-48b0-b6f4-02fefe816848"
        }
      + tags_all                             = {
          + "Name"                 = "test-dev-bastion"
          + "Role"                 = "bastion"
          + "git_commit"           = "052ad3ac2e9ee12416613febf92b9393b74fb6b0"
          + "git_file"             = "modules/ec2-external/main.tf"
          + "git_last_modified_at" = "2023-05-26 08:12:26"
          + "git_last_modified_by" = "dmytro@itsyndicate.org"
          + "git_modifiers"        = "dmytro"
          + "git_org"              = "dmytro-its"
          + "git_repo"             = "lecture-infracost"
          + "yor_name"             = "ec2_instance"
          + "yor_trace"            = "4e333bf3-548f-48b0-b6f4-02fefe816848"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09b90a3f9f2a80f9d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "test-dev-bastion-root"
            }
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:448058496623:targetgroup/test-dev-TG/5801f93be1b90197]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.front_http[0] will be created
  + resource "aws_lb_listener" "front_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:448058496623:loadbalancer/app/test-dev-alb/d920547b71928cb0"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-alb"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }
      + tags_all          = {
          + "DevOps"      = "devops@itsyndicate.org"
          + "Environment" = "develop"
          + "ManagedBy"   = "Terraform - Only IaC Changes"
          + "Name"        = "test-dev-alb"
          + "Project"     = "Lecture"
          + "group"       = "ITS"
          + "team"        = "ITS"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: e223c56333d63ba2944d3256689d753827523361

*Pusher: @dmytro-its, Action: `pull_request`, Working Directory: `terragrunt/dev`, Workflow: `Terragrunt CI/CD Pipeline`*